name: "x3d_violence"
backend: "onnxruntime"

max_batch_size: 8

input [
  {
    name: "video"
    data_type: TYPE_FP32
    dims: [3,16,224,224]
  }
]

output [
  {
    name: "logits"
    data_type: TYPE_FP32
    dims: [2]
  }
]

instance_group [
  {
    kind: KIND_GPU
    count: 1
    gpus: [0]
  }
]
